pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f3_sine_square_gen.c
//Run openocd for debugging
//openocd -f ~/NetBeansProjects/STM32/F303/STM_Sine_Square_Gen/STM32F303CBT6.cfg
//openocd -f ~/Data/NetbeansProjects/STM32/F303/STM32F3_Sine_Square_Gen/STM32F303CBT6.cfg

#include "stm32f303_db.h"
#include "usb.h"
#include "sintab.h"

//STM3F303 has:
//  a different clock configuration and other AHB and ABP bus setup
//  enabling of peripherals is done in the same way, but differ in what is connected to which bus
//  a different GPIO setup
//  a different way of moving alternate functions for the pins. AFIO is SYSCFG and is used to remap functions not pins
//  the ADC's are different in configuration and usage
//  the xB device has 32KB of standard RAM and 8KB of core coupled memory
//  the xC device has 40KB of standard RAM and 8KB of core coupled memory

//The top of stack is set to the address right after the end of the internal RAM
//For the xB version this is at 0x20007D00 (32KB)
//For the xC version this is at 0x20009C40 (40KB)
#define STACK_TOP 0x20007D00

//Simple embedded systems can do without a separate heap.
//This means not using standard libraries
//Memory is statically declared and used.
//To allow for a proper working leave memory for the stack to grow so do not use more then RAM size - 1024 bytes

//Programming the STM32 in C starting from the reset vector needs the following steps in given order
// 1) Setup the interrupt and exception vector table
// 2) Configure C variables (resetHandler)
// 3) Configure the clock system and enable the needed peripheral clocks
// 4) Configure the input / output pins
// 5) Configure the peripherals
// 6) Enable the interrupts
// 7) Loop through the main code

extern unsigned char  INIT_DATA_VALUES;
extern unsigned char  INIT_DATA_START;
extern unsigned char  INIT_DATA_END;
extern unsigned char  BSS_START;
extern unsigned char  BSS_END;

int main(void);
void resetHandler(void);
void tim2IrqHandler(void);
void tim3IrqHandler(void);

//Vector table is setup in flash at the ".vectors" location, which is defined in the linker script file stm32f303-128k.ld
//See ST manual PM0214 chapter 2.3.4
const void * intVectors[76] __attribute__((section(".vectors"))) =
{
    (void*) STACK_TOP,
    resetHandler,
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,
    0,0,0,0,0,0,0,0,0,0,
    0,0,0,0,0,0,0,0,0,0,
    usbIrqHandler,
    0,0,0,0,
    0, //tim1IrqHandler,
    0,0,
    tim2IrqHandler,
    tim3IrqHandler,
    0,0,0,0,0,0,0,0,0
};

//On reset this handler is called to setup the initial memory state
void resetHandler(void)
{
  unsigned char volatile *src;
  unsigned char volatile *dst;
  unsigned len;

  //Setup pointers and counter for copying initial values from flash to normal memory
  //This concerns all variables that are declared globally with an initial value
  src= &INIT_DATA_VALUES;
  dst= &INIT_DATA_START;
  len= &INIT_DATA_END - &INIT_DATA_START;

  while(len--)
    *dst++ = *src++;

  //Setup pointer and counter for erasing all the other variables
  dst = &BSS_START;
  len = &BSS_END - &BSS_START;

  while(len--)
    *dst++=0;

  //Go and start the main process
  main();
}

//The number of microseconds must be less then 1864135. (just over 1.8 second)
//Multiplied by 9 gives the number of ticks.
//With this it can only lead to a single timer overflow, which this function can handle
void usdelay(int32_t usec)
{
  int32_t end = STK->VAL - (usec * 9);

  //Check if there is the need to wait for an timer overflow
  if(end <= 0)
  {
    //Wait for the overflow to occur
    while((STK->CTRL & STK_CTRL_OVERFLOW) == 0);

    //calculate the new end value
    end += 0x00FFFFFF;
  }

  //Wait till the timer reaches the intended value for the given delay
  while(STK->VAL >= end);
}

//Simple function for setup of an IO pin
void InitIOPin(GPIO_TypeDef *port, uint32_t pin, uint32_t setting, uint32_t alternatefunction)
{
  //Each pin uses two bits in the mode register for four modes (MODER)
  // 00 input
  // 01 general purpose output
  // 10 alternate function
  // 11 analog
  
  //For an output there are two types (OTYPER)
  // 0 Pull up / down
  // 1 Open drain
  
  //There are three output speed settings (OSPEEDR)
  // x0 Low speed
  // 01 Medium speed
  // 11 High speed
  
  //There are three pull up and pull down possibilities (PUPDR)
  // 00 No pull up or pull down
  // 01 Pull up
  // 10 Pull down

  //Create a base pointer for either the lower or the higher alternate function register
  __IO uint32_t *reg;
  
  //2 bit settings need to be shifted twice the distance
  uint32_t shifter = pin * 2;

  //Set the requested configuration
  port->MODER |= (setting & GPIO_MODE_MASK) << shifter;
  port->OTYPER |= ((setting & GPIO_TYPE_MASK)  >> 4) << pin;
  port->OSPEEDR |= ((setting & GPIO_SPEED_MASK) >> 8) << shifter;
  port->PUPDR |= ((setting & GPIO_PUPD_MASK) >> 12) << shifter;

  //See if the lower alternate function register or the higher alternate function register needs to be used
  if(pin < 8)
  {
    //Low control register used for first 8 pins
    reg = &port->AFR[0];
  }
  else
  {
    //Force pin into 8 pins per register range
    pin -= 8;

    //High control register used for upper 8 pins
    reg = &port->AFR[1];
  }

  //4 control bits used per pin
  pin *= 4;

  //Reset bits first and set new mode and configuration.
  *reg &= ~(0x0F << pin);
  *reg |=  ((alternatefunction & 0x0F) << pin);
}

void writedisplay(uint8_t data, uint8_t type)
{
  //Based on type set the RS line (low for commands, high for data)
  if(type == 0)
    GPIOC->ODR &= ~(1 << 14);
  else
    GPIOC->ODR |= 1 << 14;

  //Put upper four bits on data bus and allow for some data setup time
  GPIOA->ODR &= 0xFFF0;
  GPIOA->ODR |= data >> 4;
  usdelay(2);

  //pulse display enable high for at least a microsecond
  GPIOC->ODR |= 1 << 15;
  usdelay(2);
  GPIOC->ODR &= ~(1 << 15);
  usdelay(20);

  //Put lower four bits on data bus and allow for some data setup time
  GPIOA->ODR &= 0xFFF0;
  GPIOA->ODR |= data & 0x0F;
  usdelay(2);

  //pulse display enable high for at least a microsecond
  GPIOC->ODR |= 1 << 15;
  usdelay(2);
  GPIOC->ODR &= ~(1 << 15);

  //Wait for data to be processed (>37us)
  usdelay(100);
}

void initdisplay(void)
{
  //Make sure enable is low to start with
  GPIOC->ODR &= ~(1 << 15);

  //Wait at least 50ms after reset
  usdelay(50000);

  //Reset display by setting it to 8 bit mode three times in a row with long delays in between
  GPIOA->ODR &= 0xFFF0;
  GPIOA->ODR |= 3;
  usdelay(2);

  //pulse display enable high for at least a microsecond and wait 4.5ms
  GPIOC->ODR |= 1 << 15;
  usdelay(2);
  GPIOC->ODR &= ~(1 << 15);
  usdelay(4500);

