pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f3_sine_square_gen.c
  //pulse display enable high again for at least a microsecond and wait 4.5ms
  GPIOC->ODR |= 1 << 15;
  usdelay(2);
  GPIOC->ODR &= ~(1 << 15);
  usdelay(4500);

  //pulse display enable high for third and last time for at least a microsecond and wait 150us
  GPIOC->ODR |= 1 << 15;
  usdelay(2);
  GPIOC->ODR &= ~(1 << 15);
  usdelay(150);

  //Set display in 4 bits mode by resetting D4 and allow for some data setup time
  GPIOA->ODR &= 0xFFFE;
  usdelay(2);

  //pulse display enable high for at least a microsecond and wait 100us
  GPIOC->ODR |= 1 << 15;
  usdelay(2);
  GPIOC->ODR &= ~(1 << 15);
  usdelay(100);

  //Keep display in 4 bits mode and specify 2 lines with 5x8 font
  writedisplay(0x28, 0);

  //Turn display on without blinking cursor
  writedisplay(0x0C, 0);

  //Clear the display
  writedisplay(0x01, 0);

  //Wait till cleared
  usdelay(2000);

  //Set entry mode to no shift and increment address
  writedisplay(0x06, 0);

  //Wait till entry mode is set
  //Some displays need a long time
  usdelay(20000);
}

void displaystring(char *string, uint8_t position)
{
  uint8_t pos;

  while(*string)
  {
    //Translate input position to display position
    pos = position++;

    if((pos >= 20) && (pos < 40))
      pos += 44;
    else if((pos >= 40) && (pos < 60))
      pos -= 20;
    else if((pos >= 60) && (pos < 80))
      pos += 24;

    writedisplay(0x80 + pos,0);  //Output position command
    writedisplay(*string++,1);   //Write the actual character
  }
}

void displayint(int32_t value, uint8_t position)
{
  //Decimal
  //Hexadecimal
  //Left justify
  //Right justify (default)
  //Left pad with 0
  //left pad with spaces
  char      b[12] = { ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '\0'};
  uint32_t  u = value;
  uint8_t   n = 0;
  uint8_t   i = 11;

  if(value == 0)
  {
    //Put a 0 in the for last index
    b[--i] = '0';
  }
  else
  {
    //Check if negative value
    if(value < 0)
    {
      //Negate if so and signal negative sign needed
      u = -value;
      n = 1;
    }

    //Process the digits
    while(u)
    {
      //Add current digit to decreased index
      b[--i] = (u % 10) + '0';

      //Take of the current digit
      u /= 10;
    }
  }

  //Check if negative number and if so put a minus in front of it
  if(n == 1)
    b[--i] = '-';

  //Display the string from the current index
  displaystring(&b[i], position);
}

void displaydegree(int32_t value, uint8_t position)
{
  char      b[12] = { ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '0', '.', '0', '\0'};
  uint32_t  u = value / 2;
  uint8_t   i = 9;

  if(u == 0)
  {
    b[--i] = '0';
  }
  else
  {
    while(u)
    {
      b[--i] = (u % 10) + '0';

      u /= 10;
    }
  }

  //Check if half a degree
  if(value & 1)
    b[10] = '5';

  displaystring(&b[i], position);
}

//Table for decoding states of a rotary encoder
const int8_t encoderstates[] = { 0, 0, 0, 0, 0, 0, 0, -1, 0, 0, 0, 1, 0, 0, 0, 0 };

//Table for square wave states
//Write to BSRR register. A 1 sets or resets a pin based on upper (reset) or lower (set) 16 bits.
//Output on pin B6, B7, B8, B9
//Initial state needs to be B6 low, B7 high, B8 low, B9 high (0000 0010 1000 0000) 0x0280
//0000 0010 0100 0000 => 0000 0000 1000 0000 0000 0000 0100 0000
//0000 0001 0100 0000 => 0000 0010 0000 0000 0000 0001 0000 0000
//0000 0001 1000 0000 => 0000 0000 0100 0000 0000 0000 1000 0000
//0000 0010 1000 0000 => 0000 0001 0000 0000 0000 0010 0000 0000
//const int16_t squarewavestates[] = {0x0240, 0x0140, 0x0180, 0x0280};
const int32_t squarewavestates[] = {0x00800040, 0x02000100, 0x00400080, 0x01000200};

//Variables now global for reading in interrupt routine
volatile int16_t phase = 0;
volatile int16_t prevphase = 0;
volatile int16_t phasediff;
volatile int16_t sinephase;
volatile int16_t squarephase;
volatile int16_t currentphase;
volatile int16_t timcnt;

//Main program part
int main(void)
{
  //Setup flash to work with 72MHz clock
  //Enable the Prefetch Buffer and Set to 2 wait states
  FLASH->ACR = FLASH_ACR_PRFTBE | FLASH_ACR_LATENCY_2;

  //Configure system clock
  //External oscillator: 8MHz
  //PLL multiplier: x9
  //SYSCLK: 72MHz
  //AHB: SYSCLK = 72MHz
  //APB1: SYSCLK/2 = 36MHz  //Timer 2,3 and 4 run on 72MHz since APB1 divider is not 1
  //APB2: SYSCLK/2 = 36MHz  //Timer 1 also runs on 72MHz since APB2 divider is not 1
  //ADC: SYSCLK/6 = 12MHz
  //USB: SYSCLK/1.5 = 48MHz
  RCC->CFGR = RCC_CFGR_PLLMULL9 | RCC_CFGR_PLLSRC | RCC_CFGR_PPRE1_DIV2 | RCC_CFGR_PPRE2_DIV2;

  //Enable external oscillator
  RCC->CR |= RCC_CR_HSEON;

  //Wait for the clock to become stable
  while((RCC->CR & RCC_CR_HSERDY) != RCC_CR_HSERDY);

  //Enable the PLL
  RCC->CR |= RCC_CR_PLLON;

  //Wait for the PLL to become stable
  while((RCC->CR & RCC_CR_PLLRDY) != RCC_CR_PLLRDY);

  //Switch to the PLL clock as system clock source. Since on reset these bits are set to 0 no need to clear first.
  RCC->CFGR |= RCC_CFGR_SW_PLL;

  //Wait for the PLL to become the clock source
  while((RCC->CFGR & RCC_CFGR_SWS_PLL) != RCC_CFGR_SWS_PLL);

  //From this point on it is not possible to change the clock configuration without switching back to HSI

  //Enable the used peripherals. PORTA, PORTB, PORTC and DMA1
  RCC->AHBENR |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOBEN | RCC_AHBENR_GPIOCEN | RCC_AHBENR_DMA1EN; //RCC_AHBENR_ADC12EN |  | RCC_AHBENR_DMA2EN
  
  //Enable TIM1
  RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;

  //Enable TIM2, TIM3 and DAC1
  RCC->APB1ENR |= RCC_APB1ENR_TIM2EN | RCC_APB1ENR_TIM3EN | RCC_APB1ENR_DAC1EN;
  
  //Enable the system timer for delay function
  //In default setting with 72MHz AHB clock this timer runs on 9MHz, so 111ns per tick. Takes 9 ticks for a microsecond
  STK->LOAD = 0x00FFFFFF;
  STK->CTRL = STK_CTRL_ENABLE;
  
  //Decide which clock is best to be used for the ADC
  //There are two possibilities. AHB clock divided by 1,2 of 4 to be synchronous with the AHB clock
  //or the pll clock divided by a prescaler. With this clock the conversions can be asynchronous to timer triggers and lead to jitter.
  
