pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f3_sine_square_gen.c
  //PA2 is ADC1_IN3  (PA3 is ADC1_IN4 and negative input for IN3 in differential mode)
  //PA6 is ADC2_IN3  (PA7 is ADC2_IN4 and negative input for IN3 in differential mode)
  
  //Before using the ADC it is needed to turn on the internal voltage regulator
  //It is also needed to calibrate the ADC. When both single ended and differential inputs are used one needs
  //to do separate calibrations for each type. Otherwise only the one for the type in use needs to be done
  //Only after these steps the ADC can be enabled
  //After enabling the ADC a wait until ADCRDY is set needs to be done before converting any channels
  
  //For simultaneous getting the voltage and the current it is possible to use the master slave mode of two connected ADC's
  //Select the regular simultaneous mode
  
  //To reduce noise the ADC clock can be lowered to sysclk/4 when synchronous mode is used.
  //With a sample time of 7.5 clock cycles the conversion is done in 20 clock cycles. This leads to a max rate
  //of 900KHz when the sysclk is 72MHz
  
  //ADC1 uses DMA1 channel1
  //ADC2 uses DMA2 either channel1 or channel3 (only when remapped)
  
  //On the blue pill the VDDA pin is connected to VDD, so DAC output can be routed back into the ADC.
  
  //Init the USB device
  usbInit();

  //IO pins need to be configured first
  //Pin with LED to show activity
  InitIOPin(GPIOC, 13, GPIO_OUTPUT_PP_LOW_SPEED, 0);
  
  //Time measurement pin irq tim 3
  InitIOPin(GPIOA, 6, GPIO_OUTPUT_PP_MEDIUM_SPEED, 0);

  //SPI Display connections
  //InitIOPin(GPIOA, 2, GPIO_OUTPUT_PP_MEDIUM_SPEED, 0);  //Reset                 (RES) (RESET)
  //InitIOPin(GPIOA, 3, GPIO_OUTPUT_PP_MEDIUM_SPEED, 0);  //Register select       (RS) (A0) (DS/RS)
  //InitIOPin(GPIOA, 15, GPIO_AF_PP_HIGH_SPEED, 5);       //Chip select  SPI/NSS  (CS)
  //InitIOPin(GPIOB, 3, GPIO_AF_PP_HIGH_SPEED, 6);        //Clock        SPI/SCK  (SCK) (SCL)
  //InitIOPin(GPIOB, 5, GPIO_AF_PP_HIGH_SPEED, 6);        //Data         SPI/MOSI (SDA) (SDI)
  
  //LCD 1602 display connection
  //PC14 for RS, PC15 for E, PA0 - PA3 for databus
  InitIOPin(GPIOA, 0, GPIO_OUTPUT_PP_LOW_SPEED, 0);
  InitIOPin(GPIOA, 1, GPIO_OUTPUT_PP_LOW_SPEED, 0);
  InitIOPin(GPIOA, 2, GPIO_OUTPUT_PP_LOW_SPEED, 0);
  InitIOPin(GPIOA, 3, GPIO_OUTPUT_PP_LOW_SPEED, 0);
  InitIOPin(GPIOC, 14, GPIO_OUTPUT_PP_LOW_SPEED, 0);
  InitIOPin(GPIOC, 15, GPIO_OUTPUT_PP_LOW_SPEED, 0);
  
  //Rotary encoder pins. External pullups are used. Debouncing filter might be needed
  InitIOPin(GPIOB, 0, GPIO_INPUT_FLOAT, 0);
  InitIOPin(GPIOB, 1, GPIO_INPUT_FLOAT, 0);
  
  //USB pins need to be set for correct alternate function
  InitIOPin(GPIOA, 11, GPIO_AF_PP_HIGH_SPEED, 14);
  InitIOPin(GPIOA, 12, GPIO_AF_PP_HIGH_SPEED, 14);

  //Square wave output pins
  InitIOPin(GPIOB, 6, GPIO_OUTPUT_PP_LOW_SPEED, 0); //90 degree
  InitIOPin(GPIOB, 7, GPIO_OUTPUT_PP_LOW_SPEED, 0); //270 degree
  InitIOPin(GPIOB, 8, GPIO_OUTPUT_PP_LOW_SPEED, 0); //180 degree
  InitIOPin(GPIOB, 9, GPIO_OUTPUT_PP_LOW_SPEED, 0); //0 degree
  
  //DAC pin need to be set for analog
  InitIOPin(GPIOA, 4, GPIO_ANALOG, 0);
  
  //ADC input pins need to be set for analog
//  InitIOPin(GPIOA, 2, GPIO_ANALOG, 0);   //ADC1_IN3
//  InitIOPin(GPIOA, 6, GPIO_ANALOG, 0);   //ADC2_IN3
  
  //Set initial state on square wave pins
  GPIOB->ODR |= 0x0280;
  
  //Setup the DMA channel for timer 1 overflow to write data into the dac
  DMA1_Channel5->CPAR = (uint32_t)&DAC1->DHR12R1;
  DMA1_Channel5->CMAR = (uint32_t)dmasinetable_1900;
  DMA1_Channel5->CNDTR = STEPS_360_DEGREES;
  DMA1_Channel5->CCR = DMA_CCR_MSIZE_0 | DMA_CCR_PSIZE_0 | DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_DIR | DMA_CCR_EN;
  
  //Setup the DMA channel for timer 3 overflow to write data to port b
  DMA1_Channel3->CPAR = (uint32_t)&GPIOB->BSRR;
  DMA1_Channel3->CMAR = (uint32_t)squarewavestates;
  DMA1_Channel3->CNDTR = 4;
  DMA1_Channel3->CCR = DMA_CCR_MSIZE_1 | DMA_CCR_PSIZE_1 | DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_DIR | DMA_CCR_EN;
  
  //Setup the dac. Only first channel for now
  //Output buffer is enabled, no wave generation. Data is automatically transferred to the output.
  //Since DMA is used based on a timer overflow the DAC will not be triggered by an event.
  DAC1->CR = DAC_CR_EN1 | DAC_CR_BOFF1;
  
  //Initialize on half voltage
  DAC1->DHR12R1 = 2048;
  
  //Output the value
  DAC1->SWTRIGR = 1;
  
  //Timer 1 is used to trigger the dma that outputs the sine data to the dac. It runs at a frequency of 720KHz
  TIM1->CNT = 0;    //No initial count
  TIM1->PSC = 0;    //No prescaler
  TIM1->ARR = 99;   //Divide master clock by 100. Counts from 0 to 99, which is 100 ticks.

  //Timer 1 up counting. Preload and dma on update enabled.
  TIM1->DIER = TIM_DIER_UDE;
  TIM1->CR2 = TIM_CR2_MMS_1;
  
  //Timer 2 is used for blinking the led on PC13
  TIM2->CNT = 0;
  TIM2->PSC = 15999;  //72MHz / 16000 = 4500Hz
  TIM2->ARR = 1124;   //4500Hz / 1125 = 4Hz;

  //Timer 2 generates an interrupt at a 4Hz rate.
  TIM2->DIER = TIM_DIER_UIE;
  TIM2->CR1 = TIM_CR1_CEN;
    
  //Timer 3 generates the 4KHz clock to trigger the dma for the creation of the 4 square wave signals
  TIM3->CNT  = 0;                       //Initial phase on 0 degrees
  TIM3->PSC  = 0;                       //No prescaler
  TIM3->ARR  = MAX_COUNT_90_DEGREES;    //720KHz / 180 = 4KHz;
  TIM3->CCR1 = HALF_COUNT_90_DEGREES;   //For compare interrupt halfway the timer count

  //Enable the DMA trigger
  TIM3->DIER = TIM_DIER_UDE;
  TIM3->SMCR = TIM_SMCR_SMS_2 | TIM_SMCR_SMS_1 | TIM_SMCR_SMS_0;  //Clock source for timer 3 is timer 1 (TS = 000)

  //Start the timers used for sine and square wave generation  
  TIM1->CR1 = TIM_CR1_CEN;
  TIM3->CR1 = TIM_CR1_CEN;
  
  
  //ADC is for future features
  /*
  
  //Setup ADC 1 and 2 for converting simultaneous on inputs PA2 and PA6
  //Put converters in intermediate state before turning on the voltage regulator
  ADC1->CR = ADC_CR_ADVREG_INTERMEDIATE;
  ADC2->CR = ADC_CR_ADVREG_INTERMEDIATE;
  
  //Wait for 10us to make sure things are settled
  usdelay(10);
  
  //Turn on the voltage regulators
  ADC1->CR = ADC_CR_ADVREG_ON;
  ADC2->CR = ADC_CR_ADVREG_ON;
  
  //Wait for 20us to make sure things are settled
  usdelay(20);
  
  //Start calibration for single ended conversions
  ADC1->CR |= ADC_CR_ADCAL;
  ADC2->CR |= ADC_CR_ADCAL;
  
  //Wait till calibration of both converters is done
  while((ADC1->CR & ADC_CR_ADCAL) || (ADC2->CR & ADC_CR_ADCAL));

  //Setup the channels to be converted. Only a single channel per ADC
  //Channel 0 is not mapped so range is from 1 to 18.
  //Sequence count is 1 on reset
  ADC1->SQR1 = 3 << ADC_SQR1_SQ1_POS;
  ADC2->SQR1 = 3 << ADC_SQR1_SQ1_POS;

  //Setup the sample time for the channels in use. 7,5 adc clock cycles is used
  ADC1->SMPR1 = ADC_SAMPLE_TIME_7 << ADC_SMPR1_CH3_POS;
  ADC2->SMPR1 = ADC_SAMPLE_TIME_7 << ADC_SMPR1_CH3_POS;

  //Setup dual mode for simultaneous conversions 
  //Clock is synchronous HCLK divided by 4, DMA in 12bit mode
  ADC12_COMMON->CCR = ADC_CCR_CKMODE_HCLK_4 | ADC_CCR_MDMA_10_12_BIT | ADC_CCR_DMACFG_CIRCULAIR | ADC_CCR_MULTI_RS;
  
  //Setup DMA for the ADC's
  
  //Enable both converters
  ADC1->CR |= ADC_CR_ADEN;
  ADC2->CR |= ADC_CR_ADEN;
  
  //Wait till both converters are ready
  while((ADC1->ISR & ADC_ISR_ADRDY) || (ADC2->CR & ADC_ISR_ADRDY));
  
  */ 
  
  //Set priority for timer 1, 2 interrupt to be higher then the other interrupts
  //This is an array of 8 bit registers, of which only the upper 4 bits are used for the priority allowing for 16 levels
  //By grouping this is separated to allow for having sub priorities within a single group.
  //In the usb init this is set for 4 group priorities with each 4 sub priorities.
  //The higher the number the lower the priority
  //NVIC->IP[TIM1_UP_IRQn] = 0x80;  //(1000b) Group priority 2, sub priority 0
  NVIC->IP[TIM2_IRQn]    = 0x90;  //(1001b) Group priority 2, sub priority 1
  NVIC->IP[TIM3_IRQn]    = 0x80;  //(1000b) Group priority 2, sub priority 0

  //Enable the timer 1 and 2 interrupt
  //This is an array of 32 bit registers, only used to enable an interrupt. To disable the ICER registers need to be used
  //Each register serves 32 interrupts, so to get the register for the interrupt, shift the IRQ number right 5 times (divide by 32) and to get
  //the right interrupt enable bit, shift a unsigned 32 bit integer 1 the IRQ number anded with 31 (modulo 32) times to the right
  //NVIC->ISER[TIM1_UP_IRQn >> 0x05] = (uint32_t)0x01 << (TIM1_UP_IRQn & 0x1F);
  NVIC->ISER[TIM2_IRQn >> 0x05] = (uint32_t)0x01 << (TIM2_IRQn & 0x1F);
  NVIC->ISER[TIM3_IRQn >> 0x05] = (uint32_t)0x01 << (TIM3_IRQn & 0x1F);
  
  
