pecostm32/STM32F303_Sine_Square_Generator/STM32F3_Sine_Square_Gen/stm32f3_sine_square_gen.c
  //Initialize the attached display
  initdisplay();
  
  //Show the initial phase shift
  displaystring("FASE: 0.0   GRD", 0);
  
  //Variable for rotary encoder handling
  uint8_t h = 0;
  
  while(1)
  {
    //Get character from USB receive buffer
    int16_t c = usbRead();

    //Echo it when valid character
    if(c != -1)
      usbSend(c);
    
    //Rotary encoder part
    //Hardware debouncing door 10Komh pullup en 10Kohm serie weerstand en 10nf condensator naar ground.

    //2ms delay
    usdelay(2000);

    //Read the encoder pins
    h <<= 2;
    h |= (GPIOB->IDR & 0x03);

    //Modify the count accordingly
    phase += encoderstates[h & 0x0F];

    if(phase < 0)                         //Check on underrun and fall back to maximum
      phase = MAX_PHASE;
    else if(phase > MAX_PHASE)            //Check on overrun and fall back to minimum
      phase = 0;

    //Check if a change in phase
    if(phase != prevphase)
    {
      //Update previous phase for filtering
      prevphase = phase;

      //Display the new phase
      displaystring("FASE:       GRD", 0);
      displaydegree(phase, 6);
      
      //Clear any pending interrupts to make sure the event takes place on the actual moment
      TIM3->SR = 0;
      
      //And enable the compare interrupt to make the adjustment
      TIM3->DIER |= TIM_DIER_CC1IE;
    }
  }
}

//Handler for timer 2 interrupt. Only used to blink the led on the board
void tim2IrqHandler(void)
{
  //Clear the interrupt flags
  TIM2->SR = 0;

  //Toggle the led output pin
  GPIOC->ODR ^= (1 << 13);
}

//Handler for timer 3 interrupt. Used to shift the phase within certain limits
void tim3IrqHandler(void)
{
  //Set pin for time measurement PA6
  GPIOA->ODR |= 0x0040;

  //Make sure it is the compare interrupt in use
  if(TIM3->SR & TIM_SR_CC1IF)
  {
    //Determine the current phase difference
    sinephase = STEPS_360_DEGREES - DMA1_Channel5->CNDTR;         //dma counter counts down, so subtraction from max is needed
    squarephase = ((4 - DMA1_Channel3->CNDTR) * 180) + TIM3->CNT; //Each square wave dma step indicates 180 half degrees
    currentphase = sinephase - squarephase;

    //Phase needs to be positive
    if(currentphase < 0)
      currentphase += STEPS_360_DEGREES;

    //Calculate the needed phase difference
    phasediff = currentphase - phase;

    //Check if timer needs to be updated
    if(phasediff)
    {
      //Check if difference out of quarter count range and limit if so
      if(phasediff > QUARTER_COUNT_90_DEGREES)
        phasediff = QUARTER_COUNT_90_DEGREES;
      else if(phasediff < -QUARTER_COUNT_90_DEGREES)
        phasediff = -QUARTER_COUNT_90_DEGREES;
      else
        TIM3->DIER &= ~TIM_DIER_CC1IE;  //Within the limits then one correction is enough so disable the interrupt

      //Adjust timer 3 count for the new phase
      TIM3->CNT += phasediff;
    }
    else
      TIM3->DIER &= ~TIM_DIER_CC1IE;  //No correction needed so disable the interrupt
  }
  
  //Clear the interrupt flags
  TIM3->SR = 0;
  
  //Clear pin for time measurement PA6
  GPIOA->ODR &= 0xFFBF;
}
